Revit 2026 API

# StairsLandingGetAllSupports Method

---

Returns all the supports hosting the stairs landing.

**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public IList<ElementId> GetAllSupports()
```
```vb
Public Function GetAllSupports As IList(Of ElementId)
```
```cpp
public:
IList<ElementId^>^ GetAllSupports()
```
```fsharp
member GetAllSupports : unit -> IList<ElementId>
```

#### Return Value

IListElementId All the supports hosting the stairs landings.

The supports consist of left, right and middle supports of the stairs landing.

#### Reference

StairsLanding Class

Autodesk.Revit.DB.Architecture Namespace